namespace Domain.Configurations;

public class EquipmentConfiguration 
    : IEntityTypeConfiguration<EquipmentEntity>
{
    public void Configure(EntityTypeBuilder<EquipmentEntity> builder)
    {
        builder.HasKey(x => x.Id);

        builder
            .HasIndex(x => x.Name)
            .IsUnique();
        builder
            .HasIndex(x => x.Description)
            .IsUnique();
        
        builder
            .HasMany(x => x.Orders)
            .WithOne(x => x.Equipment);

        builder.HasData(new List<EquipmentEntity> {
            new()
            {
                Id = 1,
                Name = "Мини-погрузчики",
                PicturePath = "Files//Images//EquipmentPictures//1.jpg",
                Description = "Мини-погрузчик представляет собой компактное и удобное " +
                              "специализированное строительное оборудование, " +
                              "которое используется для погрузки, разгрузки и перемещения " +
                              "различных грузов на строительных площадках, складах и " +
                              "прочих объектах. Эти машины отличаются маневренностью," +
                              " удобством управления и возможностью работать в условиях ограниченного пространства.",
                CostOneHour = 1500
            },
            new()
            {
                Id = 2,
                Name = "Экскаваторы-погрузчики",
                PicturePath = "Files//Images//EquipmentPictures//2.jpg",
                Description = "Экскаваторы-погрузчики - это универсальные машины, " +
                              "которые сочетают в себе функции экскаватора и погрузчика. " +
                              "Они используются для выполнения различных работ на строительных площадках, " +
                              "дорожных работах, при уборке территории и других задачах.",
                CostOneHour = 3300
            },
            new()
            {
                Id = 3,
                Name = "Бульдозеры",
                PicturePath = "Files//Images//EquipmentPictures//3.jpg",
                Description = "Бульдозер - это тяжелая техника, предназначенная для перемещения грунта, " +
                              "выравнивания поверхности земли, разрушения сооружений и других работ на " +
                              "строительных площадках.",
                CostOneHour = 3500
            },
            new()
            {
                Id = 4,
                Name = "Фронтальные погрузчики",
                PicturePath = "Files//Images//EquipmentPictures//4.jpg",
                Description = "Фронтальные погрузчики – это специализированная техника, " +
                              "предназначенная для погрузки и перемещения грузов на строительных площадках, " +
                              "складах, заводах и других объектах. Они отличаются высокой маневренностью, " +
                              "удобством управления и большой грузоподъемностью.",
                CostOneHour = 2000
            },
            new()
            {
                Id = 5,
                Name = "Мини-экскаваторы",
                PicturePath = "Files//Images//EquipmentPictures//5.jpg",
                Description = "Мини-экскаваторы - это компактные и удобные спецтехника, " +
                              "которая применяется для проведения мелких земляных работ, " +
                              "строительства фундаментов, канализации, прокладки трубопроводов и т.д. " +
                              "В Казани можно арендовать мини-экскаваторы различных марок и моделей.",
                CostOneHour = 1500
            },
            new()
            {
                Id = 6,
                Name = "Телескопические погрузчики",
                PicturePath = "Files//Images//EquipmentPictures//6.jpg",
                Description = "Телескопические погрузчики – это многофункциональные машины, " +
                              "которые используются для подъема и перемещения грузов на строительных площадках, " +
                              "в складских помещениях и других объектах. Они обладают высокой " +
                              "грузоподъемностью и могут поднимать грузы на значительную высоту.",
                CostOneHour = 4000 
            },
            new()
            {
                Id = 7,
                Name = "Скреперы",
                PicturePath = "Files//Images//EquipmentPictures//7.jpg",
                Description = "Скреперы - это специальная техника для земельных работ, " +
                              "которая предназначена для перемещения грунта, снега, щебня и " +
                              "других материалов. Они широко используются в строительстве, " +
                              "сельском хозяйстве и дорожном строительстве.",
                CostOneHour = 1500
            },
            new()
            {
                Id = 8,
                Name = "Автогрейдеры",
                PicturePath = "Files//Images//EquipmentPictures//8.jpg",
                Description = "Автогрейдеры – это специализированная строительная техника, " +
                              "предназначенная для выравнивания поверхности грунта на строительных объектах, " +
                              "дорогах, аэродромах и других объектах инфраструктуры. " +
                              "Они обеспечивают высокую точность и качество работы благодаря специальному " +
                              "оборудованию – рабочему столу с грейдерным отвалом.",
                CostOneHour = 2000
            },
            new()
            {
                Id = 9,
                Name = "Гусеничные тракторы",
                PicturePath = "Files//Images//EquipmentPictures//9.jpg",
                Description = "Гусеничные тракторы - это мощные и надежные машины, " +
                              "которые используются для выполнения различных земельных работ, " +
                              "таких как строительство дорог, планировка местности, рыхление почвы и другие.",
                CostOneHour = 3000
            },
            new()
            {
                Id = 10,
                Name = "Колесные тракторы",
                PicturePath = "Files//Images//EquipmentPictures//10.jpg",
                Description = "Колесные тракторы - это сельскохозяйственная техника, " +
                              "предназначенная для выполнения различных работ на поле, таких как пахота, " +
                              "посев, вспашка и др. Они оснащены мощным двигателем и колесным приводом, " +
                              "что позволяет им эффективно передвигаться по неровной местности.",
                CostOneHour = 2500
            }
        });
    }
}